Documents/ПоступлениеОплатыЗаПоселение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПоступлениеОплатыЗаПоселение</Name>
			<BasedOn>
				<xr:Item>Document.Поселение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОплатаЗаездовПостояльца</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поселение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поселение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоЧастям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеОплатыЗаПоселение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоселениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Поселение) И НЕ Объект.ОплатаПоЧастям Тогда 
		ОбновитьСумму(); 
	КонецЕсли;  
	Если НЕ ЗначениеЗаполнено(Объект.Поселение) И НЕ Объект.ОплатаПоЧастям Тогда 
		ОбнулитьСумму(); 
	КонецЕсли;  
КонецПроцедуры 

&НаСервере 
Процедура ОбновитьСумму()
	Объект.Сумма = Объект.Поселение.СуммаКУплате;		
КонецПроцедуры  

&НаСервере 
Процедура ОбнулитьСумму()
	Объект.Сумма = 0;	
КонецПроцедуры  

&НаКлиенте
Процедура ОплатаПоЧастямПриИзменении(Элемент)
	Если НЕ Объект.ОплатаПоЧастям Тогда  
		ОбновитьСумму();
	КонецЕсли;  
	ЭтаФорма.Элементы.Сумма.ТолькоПросмотр = НЕ Объект.ОплатаПоЧастям;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.Сумма.ТолькоПросмотр = НЕ Объект.ОплатаПоЧастям;
КонецПроцедуры
